powerfull/src/Documents/РеализацияУслуг/РеализацияУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияУслуг</name>
  <basedOn>Document.ЗаписьКлиента</basedOn>
  <registerRecords>AccumulationRegister.ПродажаУслуг</registerRecords>
  <registerRecords>AccumulationRegister.ДеньгиОтПродажиУслугИАбонементов</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Тренер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Запись</name>
    <type>
      <types>DocumentRef.ЗаписьКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>EnumRef.Оплата</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОказываемыеУслуги</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.Услуги</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

powerfull/src/Documents/РеализацияУслуг/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ОказываемыеУслугиУслугаПриИзменении(Элемент)
	
	// Получить текущую строку табличной части.
	СтрокаТабличнойЧасти = Элементы.ОказываемыеУслуги.ТекущиеДанные;
	
	// Установить цену.
	СтрокаТабличнойЧасти.Цена = РаботаСРегистрами.РозничнаяЦенаУслуг(Объект.Дата,СтрокаТабличнойЧасти.Услуга);       
		
КонецПроцедуры

&НаКлиенте
Процедура ОказываемыеУслугиПриИзменении(Элемент)
	
	Объект.СуммаДокумента = Объект.ОказываемыеУслуги.Итог("Цена");
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКОплате(Команда)
	
	ДокументЗаписан = Ложь;
	
	Если Объект.Ссылка.Пустая() Тогда
		
		ПараметрыЗаписи = Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение);
		ДокументЗаписан = Записать(ПараметрыЗаписи);
	Иначе
		ДокументЗаписан = Истина;
		
	КонецЕсли;
	
	Если ДокументЗаписан Тогда
		СтруктураПараметров = Новый Структура("Основание", Объект.Ссылка);
		ОткрытьФорму("Документ.ОплатаУслугИАбонементов.ФормаОбъекта", СтруктураПараметров,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;		
	
КонецПроцедуры
